import SettingsSearch from "@/components/settings/SettingsSearch";

import TabieSettings from "@/components/settings/TableSettings";
import Image from "next/image";
import React from "react";

export default function activity() {
  const headers = ["#", "שלב"];

  const activity_code = [
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
    {
      activity_type: 1,
      code_namber:
        "טקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשיייייייטקסט חופשי טקסט חופשי טקסט חופשי טקסט חופשייייייי",
    },
  ];
  return (
    <>
      <div className="h-full w-full flex flex-col ">
        <div className="flex justify-between items-center w-full pb-2">
          <div className="w-full font-bold text-4xl">ניהול שלבים למדור</div>
          <SettingsSearch />
        </div>
        <div className="flex-1  overflow-hidden  ">
          <div className="h-full   dirLtr w-full px-2 overflow-y-auto ">
            <TabieSettings data={activity_code} headers={headers} />
          </div>
        </div>
      </div>
    </>
  );
}
